app/Controllers/License.php

SELECT *
FROM `ci_email_template`
WHERE `name` = 'Transfer Notification'
 LIMIT 1
---
	protected function sendmail($arrays, $template, $receiver, $file)
	{
		$mailModel = new EmailTemplate();
		$mail_data = $mailModel->where("name", $template)->first();